DataProcessors/бит_ВыгрузкаНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ВыгрузкаНачислений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХПоПериоду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХПоПериоду</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/бит_ВыгрузкаНачислений/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Разделитель = ";";
	СпособДетализации = 1;
	ЗаполнитьНачисления();
	ЗаполнитьУчастки();
	ЗаполнитьТипыКвартир();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачисления()
	
	Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_УслугиЖКХ.Ссылка КАК Начисление
		|ИЗ
		|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
		|ГДЕ
		|	НЕ бит_УслугиЖКХ.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_УслугиЖКХ.Приоритет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаНачисления = Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНачисления, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчастки()
	
	Участки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_АдминистративныеОкруга.Ссылка КАК Участок
		|ИЗ
		|	Справочник.бит_АдминистративныеОкруга КАК бит_АдминистративныеОкруга
		|ГДЕ
		|	НЕ бит_АдминистративныеОкруга.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_АдминистративныеОкруга.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаУчастки = Участки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаУчастки, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыКвартир()
	
	ТипыКвартир.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ТипыКвартиры.Ссылка КАК ТипКвартиры
		|ИЗ
		|	Справочник.бит_ТипыКвартиры КАК бит_ТипыКвартиры
		|ГДЕ
		|	НЕ бит_ТипыКвартиры.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ТипыКвартиры.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаТК = ТипыКвартир.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТК, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораКаталогаИмпорта = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталогаИмпорта.Заголовок = "Выберите каталог для выгрузки ";
	ДиалогВыбораКаталогаИмпорта.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораКаталогаИмпорта.Каталог = Каталог;
	
	Оповещение = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	ДиалогВыбораКаталогаИмпорта.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Каталог = Результат[0];
	Иначе
		ПоказатьПредупреждение(,"Каталог не выбран!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", НачалоПериода, КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РезультатВыбора, "НачалоПериода,КонецПериода");

КонецПроцедуры

&НаКлиенте
Процедура Начисления_УстановитьФлажки(Команда)
	
	Для каждого НачисленияСтрока Из Начисления Цикл
		НачисленияСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Начисления_СнятьФлажки(Команда)
	
	Для каждого НачисленияСтрока Из Начисления Цикл
		НачисленияСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_УстановитьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_СнятьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыКвартир_УстановитьФлажки(Команда)
	
	Для каждого ТипыКвартирСтрока Из ТипыКвартир Цикл
		ТипыКвартирСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыКвартир_СнятьФлажки(Команда)
	
	Для каждого ТипыКвартирСтрока Из ТипыКвартир Цикл
		ТипыКвартирСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлCSV(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Каталог) Тогда
		Сообщить("Не заполнен каталог!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
		Сообщить("Не заполнено начало периода!");
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(КонецПериода) Тогда
		Сообщить("Не заполнен конец периода!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сообщить("Не заполнена организация!");
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеНаСервере();
	Если Не ТаблицаИтог.Количество() = 0 Тогда
		СформироватьФайлCSVНаКлиенте();	
	Иначе	
		Сообщить("Не найдены данные для сохранения в файл csv!");	
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНаСервере()
	
	ТаблицаИтог.Очистить();
	
	МассивНачислений = ПолучитьМассивНачислений();
	МассивУчастков = ПолучитьМассивУчастков();
	МассивАдресов = ПолучитьМассивАдресов();
	МассивТиповКвартир = ПолучитьМассивТиповКвартир();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ) КАК Начисление,
		|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета) КАК ЛицевойСчет,
		|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий) КАК Адрес,
		|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга) КАК Участок,
		|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Дата, МЕСЯЦ) КАК Период,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот КАК Сумма,
		|	0 КАК Изменение
		|ПОМЕСТИТЬ ВТ_ДанныеДоГруппировки
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Организация = &Организация
		|				И УслугаЖКХ В (&Начисления)
		|				И 1 = 1
		|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
		|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК Справочник.бит_УслугиЖКХ),
		|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК Справочник.бит_ЛицевыеСчета),
		|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание КАК Справочник.бит_СписокЗданий),
		|	ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Здание.Район КАК Справочник.бит_АдминистративныеОкруга),
		|	НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор.Дата, МЕСЯЦ),
		|	0,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Организация = &Организация
		|				И УслугаЖКХ В (&Начисления)
		|				И 1 = 1
		|				И ЛицевойСчет.Здание.Район В (&Участки)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&ДатаОкончания, ТипКвартиры В (&ТипыКвартир)) КАК бит_СведенияОКвартиреСрезПоследних
		|		ПО бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		|ГДЕ
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДоГруппировки.Начисление КАК Начисление,
		|	ВЫБОР
		|		КОГДА &СпособДетализации = ""1""
		|			ТОГДА ВТ_ДанныеДоГруппировки.Участок
		|		КОГДА &СпособДетализации = ""2""
		|			ТОГДА ВТ_ДанныеДоГруппировки.Адрес
		|		КОГДА &СпособДетализации = ""3""
		|			ТОГДА ВТ_ДанныеДоГруппировки.ЛицевойСчет
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК АналитикаУчета,
		|	ВТ_ДанныеДоГруппировки.Период КАК Период,
		|	СУММА(ВТ_ДанныеДоГруппировки.Сумма) КАК Сумма,
		|	СУММА(ВТ_ДанныеДоГруппировки.Изменение) КАК Изменение
		|ИЗ
		|	ВТ_ДанныеДоГруппировки КАК ВТ_ДанныеДоГруппировки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеДоГруппировки.Начисление,
		|	ВТ_ДанныеДоГруппировки.Период,
		|	ВЫБОР
		|		КОГДА &СпособДетализации = ""1""
		|			ТОГДА ВТ_ДанныеДоГруппировки.Участок
		|		КОГДА &СпособДетализации = ""2""
		|			ТОГДА ВТ_ДанныеДоГруппировки.Адрес
		|		КОГДА &СпособДетализации = ""3""
		|			ТОГДА ВТ_ДанныеДоГруппировки.ЛицевойСчет
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	АналитикаУчета";
	
	Если Не МассивАдресов.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ЛицевойСчет.Здание В (&Адреса)");	
		Запрос.УстановитьПараметр("Адреса", МассивАдресов);	
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Начисления", МассивНачислений);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СпособДетализации", СпособДетализации);
	Запрос.УстановитьПараметр("Участки", МассивУчастков);
	Запрос.УстановитьПараметр("ТипыКвартир", МассивТиповКвартир);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаИтоговойТаблицы = ТаблицаИтог.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаИтоговойТаблицы, ВыборкаДетальныеЗаписи);
		Если СпособДетализации = "3" Тогда
			НоваяСтрокаИтоговойТаблицы.Здание = ВыборкаДетальныеЗаписи.АналитикаУчета.Здание;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьФайлCSVНаКлиенте()
	
	ПредставлениеСпособаДетализации = ПолучитьПредставлениеСпособаДетализации();
	ПолноеИмяФайла = Каталог + "\" + Формат(ТекущаяДата(),"ДФ='dd-MM-yyyy HH.mm.ss'") + " " + ПредставлениеСпособаДетализации + ".csv";
	ИмяВременногоФайла = КаталогВременныхФайлов() + Новый УникальныйИдентификатор + ".csv";  
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		ПолноеИмяФайла =  Каталог + "\" + ИмяФайла + ".csv";;	
	КонецЕсли; 
	
	Попытка
		
		Кодировка = КодировкаТекста.Системная;
		ТекстовыйФайлЗапись = Новый ЗаписьТекста(ИмяВременногоФайла, Кодировка);
		
		СтрокаШапки = "Начисление;АналитикаУчета;Сумма;Период;Изменение" + ?(СпособДетализации = "3", ";НаименованиеДома", "");
		ТекстовыйФайлЗапись.ЗаписатьСтроку(СтрокаШапки);
		
		Для каждого Строка Из ТаблицаИтог Цикл
			ТекстовыйДокумент = "";
			ТекстовыйДокумент = ТекстовыйДокумент + Строка.Начисление + Разделитель + Строка.АналитикаУчета + Разделитель + Формат(Строка.Сумма, "ЧГ=0") + Разделитель + Формат(Строка.Период, "ДЛФ=D") + Разделитель + Формат(Строка.Изменение, "ЧГ=0") + ?(СпособДетализации = "3", Разделитель + Строка.Здание, "");
			ТекстовыйФайлЗапись.ЗаписатьСтроку(ТекстовыйДокумент);
		КонецЦикла;
		
		ТекстовыйФайлЗапись.Закрыть();
		АдресНаСервере = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
		
		ПолучитьФайл(АдресНаСервере, ПолноеИмяФайла, Ложь);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан файл: " + ПолноеИмяФайла;
		Сообщение.Сообщить();
		
		Попытка
			УдалитьФайлы(ИмяВременногоФайла);
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеСпособаДетализации()
	
	Если СпособДетализации = "1" Тогда
		Возврат "по участкам";	
	ИначеЕсли СпособДетализации = "2" Тогда 
		Возврат "по адресам";	
	Иначе	
		Возврат "по лицевым счетам";	
	КонецЕсли; 
	
КонецФункции
 
&НаСервере
Функция ПолучитьМассивНачислений()
	
	МассивНачислений = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = Начисления.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивНачислений = Начисления.Выгрузить(,"Начисление").ВыгрузитьКолонку("Начисление");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивНачислений.Добавить(НайденнаяСтрока.Начисление);	
		КонецЦикла; 	
	КонецЕсли; 
	
	Возврат МассивНачислений;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивУчастков()
	
	МассивУчастков = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = Участки.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивУчастков = Участки.Выгрузить(,"Участок").ВыгрузитьКолонку("Участок");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивУчастков.Добавить(НайденнаяСтрока.Участок);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивУчастков;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивАдресов()
	
	МассивАдресов = Новый Массив;
	
	МассивАдресов = Адреса.Выгрузить(,"Адрес").ВыгрузитьКолонку("Адрес");
	
	Возврат МассивАдресов;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивТиповКвартир()
	
	МассивТиповКвартир = Новый Массив;
	
	Отбор = Новый Структура("ВыполняетсяОтбор", Истина);
	НайденныеСтроки = ТипыКвартир.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивТиповКвартир = ТипыКвартир.Выгрузить(,"ТипКвартиры").ВыгрузитьКолонку("ТипКвартиры");
	Иначе 	
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивТиповКвартир.Добавить(НайденнаяСтрока.ТипКвартиры);	
		КонецЦикла; 	
	КонецЕсли;
	
	Возврат МассивТиповКвартир;
	
КонецФункции
